app/views/students/_form.html.erb

    <%= form.label :section_id %>
    <%= form.collection_check_boxes :section_ids, Section.all, :id, :info %>
---
SELECT "sections".* FROM "sections"