app/views/sections/_form.html.erb

SELECT "courses".* FROM "courses" ORDER BY "courses"."name" ASC
---
    <%= form.label :course_id %>
    <%= form.collection_select :course_id, Course.order(:name),:id,:name, include_blank: true %>