app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "department", "number", "creditHour", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "math"], ["department", "Mathemathics"], ["number", 33], ["creditHour", 2], ["created_at", "2018-12-02 21:13:33.012403"], ["updated_at", "2018-12-02 21:13:33.012403"]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "name" = ?, "department" = ?, "number" = ?, "creditHour" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["name", "Biology"], ["department", "Science"], ["number", 1230], ["creditHour", 5], ["updated_at", "2018-12-02 22:52:19.228310"], ["id", 1]]