app/controllers/sections_controller.rb

  def index
    @sections = Section.all
---
SELECT "sections".* FROM "sections"

  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save
---
INSERT INTO "sections" ("semester", "number", "course_id", "room", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["semester", "fall"], ["number", 3234], ["course_id", 1], ["room", 342], ["created_at", "2018-12-02 21:20:00.062743"], ["updated_at", "2018-12-02 21:20:00.062743"]]

  def update
    respond_to do |format|
      if @section.update(section_params)
---
UPDATE "sections" SET "semester" = ?, "number" = ?, "course_id" = ?, "room" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["semester", "FALL"], ["number", 1234], ["course_id", 4], ["room", 109], ["updated_at", "2018-12-02 22:53:41.626881"], ["id", 2]]

    def set_section
      @section = Section.find(params[:id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]