app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Son"], ["number", 33], ["created_at", "2018-12-02 21:04:53.157509"], ["updated_at", "2018-12-02 21:04:53.157509"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "name" = ?, "number" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Sang Nguyen"], ["number", 9002332112], ["updated_at", "2018-12-02 22:54:26.220100"], ["id", 1]]